src/cf/InformationRegisters/ПоступившиеОбновленияЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПоступившиеОбновленияЗадач</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ДействиеЗадачи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДействиеЗадачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СобытиеОбновления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияОбновленияЗадач</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/РеестрЗадачПоИсполнителям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РеестрЗадачПоИсполнителям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДействийЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидПриложения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВидПриложенияЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСостоянияУчастниковЗадач</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСостоянийУчастниковЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВРаботе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВСрок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьЗамещающие</Name>
					<Comment>Признак наличия замещающих по действию для отбора в списке задач</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьПодзадачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Запланировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Истекает</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПереносовСроков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтрольныйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтрольныйСрокОбщий</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Новое</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОжидаетВыполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОжидаетПроверки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеПоступившихОбновлений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоступилиОбновления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриоритетыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Просрочено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПросроченоИОжидаетВыполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РезультатыДействийЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияКонтроля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеУчастникаЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияУчастниковЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПриложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПриложенийЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТрудоемкостьДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТрудоемкостьОт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Трудозатраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Флаг</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФлагиОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МожетБытьПросрочена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РеестрЗадач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РеестрыЗадач</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДействиеЗадачи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДействиеЗадачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПоступившиеОбновленияЗадач/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет запись в регистр.
//
// Параметры:
//  ДействиеЗадачи - ДокументСсылка.ДействиеЗадачи.
//  СобытиеОбновления - ПеречислениеСсылка.СобытияОбновленияЗадач.
//  ЛокальнаяЗапись - Булево.
//
Процедура ДобавитьЗапись(ДействиеЗадачи, СобытиеОбновления, ЛокальнаяЗапись) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	Попытка
	
		Период = ТекущаяДатаСеанса();
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(Период);
		НаборЗаписей.Отбор.ДействиеЗадачи.Установить(ДействиеЗадачи);
		НаборЗаписей.Отбор.СобытиеОбновления.Установить(СобытиеОбновления);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = Период;
		НоваяЗапись.ДействиеЗадачи = ДействиеЗадачи;
		НоваяЗапись.СобытиеОбновления = СобытиеОбновления;
		
		Если ЛокальнаяЗапись Тогда
			НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииКОД", Истина);
		КонецЕсли;
		
		НаборЗаписей.Записать();
		
		РаботаСЗадачами.ОбновитьПоступившиеОбновления(ДействиеЗадачи);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Возвращает записи из регистра по действиям задач.
//
// Параметры:
//  СсылкаНаДействияЗадач - Массив.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Поступившие обновления задач.
//   * Период - Дата.
//   * ДействиеЗадачи - ДокументСсылка.ДействиеЗадачи.
//   * СобытиеОбновления - ПеречислениеСсылка.СобытияОбновленияЗадач.
//
Функция ПолучитьЗаписиПоДействиямЗадач(СсылкаНаДействияЗадач) Экспорт
	
	Если СсылкаНаДействияЗадач.Количество() = 0 Тогда
		ЗаписиПоЗадачам = ТаблицаПоступившиеОбновленияЗадач();
		Возврат ЗаписиПоЗадачам;
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ПоступившиеОбновленияЗадач.Период КАК Период,
		|	ПоступившиеОбновленияЗадач.ДействиеЗадачи КАК ДействиеЗадачи,
		|	ПоступившиеОбновленияЗадач.СобытиеОбновления КАК СобытиеОбновления
		|ИЗ
		|	РегистрСведений.ПоступившиеОбновленияЗадач КАК ПоступившиеОбновленияЗадач
		|ГДЕ
		|	ПоступившиеОбновленияЗадач.ДействиеЗадачи В(&СсылкаНаДействияЗадач)");
	
	Запрос.УстановитьПараметр("СсылкаНаДействияЗадач", СсылкаНаДействияЗадач);
	
	РезультатЗапроса = Запрос.Выполнить();
	ЗаписиПоЗадачам = РезультатЗапроса.Выгрузить();
	
	Возврат ЗаписиПоЗадачам;
	
КонецФункции

// Возвращает записи события из регистра по задаче.
//
// Параметры:
//  ДействиеЗадачи - ДокументСсылка.ДействиеЗадачи.
//  СобытиеОбновления - ПеречислениеСсылка.СобытияОбновленияЗадач.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Поступившие обновления задач.
//   * Период - Дата.
//   * ДействиеЗадачи - ДокументСсылка.ДействиеЗадачи.
//   * СобытиеОбновления - ПеречислениеСсылка.СобытияОбновленияЗадач.
//
Функция ПолучитьЗаписиПоЗадачеИСобытию(ДействиеЗадачи, СобытиеОбновления) Экспорт
	
	Если Не ЗначениеЗаполнено(ДействиеЗадачи) Или Не ЗначениеЗаполнено(СобытиеОбновления) Тогда
		ЗаписиПоЗадачеИСобытию = ТаблицаПоступившиеОбновленияЗадач();
		Возврат ЗаписиПоЗадачеИСобытию;
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ПоступившиеОбновленияЗадач.Период КАК Период,
		|	ПоступившиеОбновленияЗадач.ДействиеЗадачи КАК ДействиеЗадачи,
		|	ПоступившиеОбновленияЗадач.СобытиеОбновления КАК СобытиеОбновления
		|ИЗ
		|	РегистрСведений.ПоступившиеОбновленияЗадач КАК ПоступившиеОбновленияЗадач
		|ГДЕ
		|	ПоступившиеОбновленияЗадач.ДействиеЗадачи = &ДействиеЗадачи
		|	И ПоступившиеОбновленияЗадач.СобытиеОбновления = &СобытиеОбновления");
	
	Запрос.УстановитьПараметр("ДействиеЗадачи", ДействиеЗадачи);
	Запрос.УстановитьПараметр("СобытиеОбновления", СобытиеОбновления);
	
	РезультатЗапроса = Запрос.Выполнить();
	ЗаписиПоЗадачеИСобытию = РезультатЗапроса.Выгрузить();
	
	Возврат ЗаписиПоЗадачеИСобытию;
	
КонецФункции

// Удаляет запись из регистра.
//
// Параметры:
//  Период - Дата.
//  ДействиеЗадачи - ДокументСсылка.ДействиеЗадачи.
//  СобытиеОбновления - ПеречислениеСсылка.СобытияОбновленияЗадач.
//  ЛокальнаяЗапись - Булево.
//
Процедура УдалитьЗапись(Период, ДействиеЗадачи, СобытиеОбновления, ЛокальнаяЗапись) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(Период);
	НаборЗаписей.Отбор.ДействиеЗадачи.Установить(ДействиеЗадачи);
	НаборЗаписей.Отбор.СобытиеОбновления.Установить(СобытиеОбновления);
	
	Если ЛокальнаяЗапись Тогда
		НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииКОД", Истина);
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
	РаботаСЗадачами.ОбновитьПоступившиеОбновления(ДействиеЗадачи);
	
КонецПроцедуры

// Удаляет порцию устаревших данных из регистра.
// Удаление выполняется локально в каждом узле распределенной базы - удаление данных не поступает в обмен.
//
// Возвращаемое значение:
//  Булево - Истина, если были найдены устаревшие данные, в противном случае Ложь.
//
Функция УдалитьПорциюУстаревшихДанных() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Очистка регистра сведений поступившие обновления задач'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Информация,,,
		НСтр("ru = 'Начало выполнения'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ЕстьДанныеДляУдаления = Ложь;
	
	// Удаление поступивших обновлений выполненных и прерванных задач.
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ДействияЗадач.ДействиеЗадачи Как ДействиеЗадачи
		|ИЗ
		|	РегистрСведений.РеестрЗадачПоИсполнителям КАК ДействияЗадач
		|ГДЕ
		|	ДействияЗадач.ПоступилиОбновления = ИСТИНА
		|	И ДействияЗадач.РеестрЗадач = ЗНАЧЕНИЕ(Справочник.РеестрыЗадач.ВсеЗадачи)
		|	И ДействияЗадач.ОжидаетВыполнения = ЛОЖЬ");
	
	УстаревшиеДействияЗадач = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДействиеЗадачи");
	
	УстаревшиеЗаписи = ПолучитьЗаписиПоДействиямЗадач(УстаревшиеДействияЗадач);
	Для Каждого Запись Из УстаревшиеЗаписи Цикл
		
		ЕстьДанныеДляУдаления = Истина;
		
		Попытка
			
			УдалитьЗапись(Запись.Период, Запись.ДействиеЗадачи, Запись.СобытиеОбновления, Истина);
			
		Исключение
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Очистка регистра сведений поступившие обновления задач'",
					ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЦикла;

	
	ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Очистка регистра сведений поступившие обновления задач'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Информация,,,
		НСтр("ru = 'Завершение'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	Возврат ЕстьДанныеДляУдаления;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Формирует пустую таблицу поступивших обновлений задач.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Пустая таблица поступивших обновлений задач.
//   * Период - Дата.
//   * ДействиеЗадачи - ДокументСсылка.ДействиеЗадачи.
//   * СобытиеОбновления - ПеречислениеСсылка.СобытияОбновленияЗадач.
//
Функция ТаблицаПоступившиеОбновленияЗадач()
	
	ТаблицаПоступившиеОбновленияЗадач = Новый ТаблицаЗначений;
	ТаблицаПоступившиеОбновленияЗадач.Колонки.Добавить("Период",
		ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ТаблицаПоступившиеОбновленияЗадач.Колонки.Добавить("ДействиеЗадачи",
		Метаданные.РегистрыСведений.ПоступившиеОбновленияЗадач.Измерения.ДействиеЗадачи.Тип);
	ТаблицаПоступившиеОбновленияЗадач.Колонки.Добавить("СобытиеОбновления",
		Метаданные.РегистрыСведений.ПоступившиеОбновленияЗадач.Измерения.СобытиеОбновления.Тип);
	
	Возврат ТаблицаПоступившиеОбновленияЗадач;
	
КонецФункции

#КонецОбласти

#КонецЕсли
